cf_billing/InformationRegisters/энргДлительностиПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДлительностиПериодов</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДлительностиПериодов/Forms/ФормаГрупповоеИзменение/Ext/Form/Module.bsl
#Область КомандыФормы

&НаКлиенте
Процедура Записать(Команда)  	
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ДлительностиПериодов.Очистить();
	ЗаполнитьНаСервере();
	ДлительностиПериодов.Сортировать("Район,Сезонность");
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	СтрокиДляУдаления 				= Новый Массив;
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Прочитать();
	Для Каждого СтрокаНабора Из Набор Цикл
		Если СтрокаНабора.Период 	= Дата(Год,1,1) Тогда
			СтрокиДляУдаления.Добавить(СтрокаНабора);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиДляУдаления.ВГраница() Цикл
		Набор.Удалить(СтрокаНабора);
	КонецЦикла;
	Набор.Записать();
		
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТЧ Из ДлительностиПериодов Цикл
		СтрокаНабора 				= Набор.Добавить();
		СтрокаНабора.Период 		= Дата(Год,1,1);
		СтрокаНабора.Организация 	= Организация;
		СтрокаНабора.Район 			= СтрокаТЧ.Район;
		СтрокаНабора.Сезонность 	= СтрокаТЧ.Сезонность;
		СтрокаНабора.НачалоПериода 	= СтрокаТЧ.НачалоПериода;
		СтрокаНабора.КонецПериода 	= СтрокаТЧ.КонецПериода;
	КонецЦикла;
	
	Попытка
		Набор.Записать(Ложь);
	Исключение
		ИнформацияОбОшибке 			= ИнформацияОбОшибке();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке); 
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СрезПоследних(Дата(Макс(Год,1),1,1),Новый Структура("Организация",Организация));
	Для Каждого СтрокаНабора Из Набор Цикл
		СтрокаТаблицы 				= ДлительностиПериодов.Добавить();
		СтрокаТаблицы.Район		 	= СтрокаНабора.Район;
		СтрокаТаблицы.Сезонность 	= СтрокаНабора.Сезонность;
		СтрокаТаблицы.НачалоПериода = СтрокаНабора.НачалоПериода;
		СтрокаТаблицы.КонецПериода 	= СтрокаНабора.КонецПериода;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
